{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2023-07-21T14:38:22.7366306Z",
    "creationSource": null,
    "description": "",
    "lastModifiedDateTime": "2024-05-17T15:48:45.3147782Z",
    "name": "Enable FileVault in Setup Assistant",
    "platforms": "macOS",
    "priorityMetaData": null,
    "roleScopeTagIds": [
        "0"
    ],
    "settingCount": 3,
    "technologies": "mdm,appleRemoteManagement",
    "id": "71ac189d-745e-41d8-959e-54f7d53fe8ff",
    "templateReference": {
        "templateId": "",
        "templateFamily": "none",
        "templateDisplayName": null,
        "templateDisplayVersion": null
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
                "settingInstanceTemplateReference": null,
                "groupSettingCollectionValue": [
                    {
                        "settingValueTemplateReference": null,
                        "children": [
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.mcx.filevault2_defer",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.mcx.filevault2_defer_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.mcx.filevault2_enable",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.mcx.filevault2_enable_0",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.mcx.filevault2_forceenableinsetupassistant",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.mcx.filevault2_forceenableinsetupassistant_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.mcx.filevault2_showrecoverykey",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.mcx.filevault2_showrecoverykey_false",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.mcx.filevault2_userecoverykey",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.mcx.filevault2_userecoverykey_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.mcx.filevault2_userentersmissinginfo",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.mcx.filevault2_userentersmissinginfo_false",
                                    "children": []
                                }
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "1",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.mcx_com.apple.mcx-fdefilevaultoptions",
                "settingInstanceTemplateReference": null,
                "groupSettingCollectionValue": [
                    {
                        "settingValueTemplateReference": null,
                        "children": [
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.mcx_dontallowfdedisable",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.mcx_dontallowfdedisable_true",
                                    "children": []
                                }
                            },
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                "settingDefinitionId": "com.apple.mcx_dontallowfdeenable",
                                "settingInstanceTemplateReference": null,
                                "choiceSettingValue": {
                                    "settingValueTemplateReference": null,
                                    "value": "com.apple.mcx_dontallowfdeenable_false",
                                    "children": []
                                }
                            }
                        ]
                    }
                ]
            }
        },
        {
            "id": "2",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.security.fderecoverykeyescrow_com.apple.security.fderecoverykeyescrow",
                "settingInstanceTemplateReference": null,
                "groupSettingCollectionValue": [
                    {
                        "settingValueTemplateReference": null,
                        "children": [
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "com.apple.security.fderecoverykeyescrow_location",
                                "settingInstanceTemplateReference": null,
                                "simpleSettingValue": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": "https://user.manage.microsoft.com"
                                }
                            }
                        ]
                    }
                ]
            }
        }
    ]
}